circular-cylinder-10-1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       4670;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       4710;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       4750;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          50;
        startFace       4800;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       4850;
    }
    frontandback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4800;
        startFace       4930;
    }
)

// ************************************************************************* //
